Revit 2027 API
BuiltInFailures.StairRampFailures.StairsActualTreadDepthLessThanMinimumFailure Property
 Computed actual tread depth of stairs is less than minimum tread depth defined in stairs type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsActualTreadDepthLessThanMinimumFailure { get; }
Public Shared ReadOnly Property StairsActualTreadDepthLessThanMinimumFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsActualTreadDepthLessThanMinimumFailure {
	FailureDefinitionId^ get ();
}
static member StairsActualTreadDepthLessThanMinimumFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace